<?php
// = равенство
// == проверка на равенство

$x = 12;
$y = 34;
$z = 4.25;

$bool_1 = $x != $z; //Проверка равности. == Равны друг другу. != Не равны друг другу
$bool_2 = $x <=  $y; // >, <, >=, <=
echo $bool_1."<br />".$bool_2. "<hr />";

$bool_3 = !($x == $y); //Переворачивает значение
$bool_4 = $x == $y || $z < $y; //Логическое или,одно иззначение 1
$bool_5 = $z != $y && $x < $y; //Логическое и, обазначения 1
$bool_6 = $z != $x ^ $y < $z; //Взаимоисключение или, толькокогдаодно из  них 1
echo "<br />".$bool_3."<br />".$bool_4."<br>".$bool_5."<br/>".$bool_6;

$bool = !($x != $y && $z < $x) || $x !=$y;
echo "<br /> $bool = !($x != $y && $z < $x) || $x !=$y";


?>