<!DOCTYPE html>
<html>
<head>
    <title>Проверка</title>
    <meta charset="utf-8" />
</head>
<body>
<h1> Заголовок 1</h1>
<p> 1 абзац</p>
<p> <strong>2 абзац</strong></p>
<p><abbr title="Hyper Text Mark-up Language">HTML</abbr></p>
<address>США. штат Вашингтон</address>
<p>Этот <strong>текст пробный</strong></p>
<small>Маленький</small>
<big>Большой</big>
<pre>Текст        проблем
    Ентер</pre>
<br /><br /><br />
<blockquote сite="google.com"><p>Что такое хостинг? Что такое домен? Как их связать? Что такое NS записи?
        Какие web серверы бывают (apache, nginx).
    </p></blockquote>
<p align="center"><q>Цитата с ковычками</q></p>
<hr />  <br />
<nobr>Что такое хостинг? Что такое домен? Как их связать? Что такое NS записи?
    Какие web серверы бывают (apache, nginx). Их преимущества и недостатки.
    Как происходит обмен данными между браузером и сайтом (сервером). Изучить передаваемые заголовки HTTP/1.1
    Файл htaccess. Для чего используется. Когда он не работает.
    Как через htaccess поставить редирект использую RewriteRule. Когда нужно использовать RewriteCond. Посмотреть как ставить редирект с параметрического адреса.
    Что такое FTP и SSH. Какие программы есть для работы по данным протоколам.
    Что такое SSL сертификат. Какие бывают. Как работает.
</nobr>


</body>
</html>